12/data/attachments/b229116cabf7194e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6cf6109e-6903-4532-a6c8-84eaf49ac264</nif:username>
            <nif:friendToBeAdded>Christopher_level_Friend_50946_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>